       01  PROGRAM-TABLE-IN.
       05  TABLE-PROGRAM-REC-IN OCCURS 20 TIMES.
           10 TABLE-PROGRAM-CODE   PIC X(5).
           10 TABLE-PROGRAM-NAME   PIC X(20).